<div style="text-align:center;margin-bottom:50px;">
    <img src="img/LogoSingleRow.png" style="max-width:600px;">
</div>

# Top 3 Pandas Functions

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

# 1. apply()

In [3]:
def extract_title(string):
    string = string.split(',')[-1]
    string = string.strip()
    string = string.split('.')[0]
    return string

In [4]:
titles = df['Name'].apply(extract_title)
titles[:5]

0      Mr
1     Mrs
2    Miss
3     Mrs
4      Mr
Name: Name, dtype: object

In [5]:
titles = df['Name'].apply(lambda x: x.split(',')[-1].strip().split('.')[0])
titles[:5]

0      Mr
1     Mrs
2    Miss
3     Mrs
4      Mr
Name: Name, dtype: object

# 2. value_counts()

In [6]:
titles.value_counts()

Mr              517
Miss            182
Mrs             125
Master           40
Dr                7
Rev               6
Mlle              2
Col               2
Major             2
Mme               1
Jonkheer          1
Sir               1
Lady              1
Don               1
the Countess      1
Capt              1
Ms                1
Name: Name, dtype: int64

In [8]:
titles.value_counts(normalize=True) * 100

Mr              58.024691
Miss            20.426487
Mrs             14.029181
Master           4.489338
Dr               0.785634
Rev              0.673401
Mlle             0.224467
Col              0.224467
Major            0.224467
Mme              0.112233
Jonkheer         0.112233
Sir              0.112233
Lady             0.112233
Don              0.112233
the Countess     0.112233
Capt             0.112233
Ms               0.112233
Name: Name, dtype: float64

# 3. get_dummies()

In [9]:
emb = pd.get_dummies(df['Embarked'])
emb.head()

   C  Q  S
0  0  0  1
1  1  0  0
2  0  0  1
3  0  0  1
4  0  0  1

In [10]:
emb = pd.get_dummies(df['Embarked'], prefix='Embarked')
emb.head()

   Embarked_C  Embarked_Q  Embarked_S
0           0           0           1
1           1           0           0
2           0           0           1
3           0           0           1
4           0           0           1

In [11]:
emb = pd.get_dummies(df['Embarked'], prefix='Embarked', drop_first=True)
emb.head()

   Embarked_Q  Embarked_S
0           0           1
1           0           0
2           0           1
3           0           1
4           0           1